Tekla Open API Reference for Tekla Structures 2025
ContainerElement.Add Method
 Adds a new element base to the end of the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	ElementBase value
)
Public Sub Add (
	value As ElementBase
)
Parameters
value
Type: Tekla.Structures.Drawing.ElementBase
The element base to be added to the list.
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace